results/mongodb/run_workload_b.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -s -P workloads/workloadb -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p operationcount=100000 -p threadcount=10
Command line: -t -db site.ycsb.db.MongoDbClient -s -P workloads/workloadb -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p operationcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-01-02 19:58:08:658 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://mongodb:27017/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-01-02 19:58:14:179 5 sec: 100000 operations; 18005.04 current ops/sec; [READ: Count=95057, Max=57087, Min=197, Avg=491.95, 90=774, 99=2953, 99.9=8179, 99.99=28687] [CLEANUP: Count=10, Max=6699, Min=2, Avg=673.6, 90=15, 99=6699, 99.9=6699, 99.99=6699] [UPDATE: Count=4943, Max=20991, Min=229, Avg=601.69, 90=960, 99=3771, 99.9=9447, 99.99=20991] 
[OVERALL], RunTime(ms), 5554
[OVERALL], Throughput(ops/sec), 18005.041411595248
[TOTAL_GCS_G1_Young_Generation], Count, 28
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 76
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.3683831472812387
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 76
[TOTAL_GC_TIME_%], Time(%), 1.3683831472812387
[READ], Operations, 95057
[READ], AverageLatency(us), 491.9515974625751
[READ], MinLatency(us), 197
[READ], MaxLatency(us), 57087
[READ], 95thPercentileLatency(us), 1132
[READ], 99thPercentileLatency(us), 2953
[READ], Return=OK, 95057
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 673.6
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 6699
[CLEANUP], 95thPercentileLatency(us), 6699
[CLEANUP], 99thPercentileLatency(us), 6699
[UPDATE], Operations, 4943
[UPDATE], AverageLatency(us), 601.6858183289501
[UPDATE], MinLatency(us), 229
[UPDATE], MaxLatency(us), 20991
[UPDATE], 95thPercentileLatency(us), 1381
[UPDATE], 99thPercentileLatency(us), 3771
[UPDATE], Return=OK, 4943